Which NFL team represented the AFC at Super Bowl 50?
Where did Super Bowl 50 take place?
Which NFL team won Super Bowl 50?
What color was used to emphasize the 50th anniversary of the Super Bowl?
What was the theme of Super Bowl 50?
What day was the game played on?
What is the AFC short for?
What was the theme of Super Bowl 50?
What does AFC stand for?
What day was the Super Bowl played on?
Who won Super Bowl 50?
What venue did Super Bowl 50 take place in?
The accused stood motionless, nothing on his face betrayed any emotion. 
It was this same lack of expression that had worried the attorney assigned to represent the man throughout the case. 
Charged with robbing an elderly woman and beating her to death, the defendant had shown no remorse, indeed he had seemed completely unconcerned even when faced with the crime photos. 
The lawyer knew his client's demeanor made the jury uncomfortable. 
Hell, it made him uncomfortable, faced with such a blank stare every day. 
Professionally, Hal knew that there was a marked lack of hard evidence against his client. 
The most damning thing during the whole proceeding had been a witness who identified David Rawlins as fleeing the scene. 
Hal had been able to cast doubt on the witness's testimony because the man had just left a bar.
Whoever committed this crime had been smart enough to leave no physical evidence behind. 
It was the same M.O. as four other crimes that had plagued the community in recent months. Hal felt confident that his client would be found not guilty.
In his closing arguments he had pointed out the similarities between the serial murders, stressing the fact that anything the police had was merely circumstantial, not enough to convict. 
Indeed, ladies and gentlemen of the jury, while we sit here today arguing this case against David Rawlins, the real criminal is still out there waiting to attack again.
That last had caused the lead detective on the case to shift uncomfortably in his seat.
With quiet respect, Hal had attended the memorial service for the victim. 
In the front of the church stood a large photo of the woman. 
It showed everyone's grandmother, small and frail with a sweet face. 
Alva Spence had been graced with an abundance of thick, grey hair that she wore in a coiled braid on top of her head fixed by a butterfly-shaped hairpin. 
She looked as though she were ready for Bingo.
Now the trial was over. 
The jury had only deliberated for 3 hours before notifying the judge they were ready with a verdict. 
As the bailiff approached the bench with the small slip of paper containing his client's future, he glanced at the man next to him. 
Rawlins stood calmly, staring straight ahead, completely unconcerned. 
Hal felt exasperated, was the other man completely incapable of emotion?
"We the jury find the defendant... Not guilty."
An anguished wail erupted from the back of the courtroom. 
Hal barely listened to the judge's instructions as he placed his paperwork into the briefcase on the table in front of him. 
He knew this part by heart from long experience.
Turning to congratulate Rawlins, he changed his mind at the closed face looking back at him. David Rawlins walked steadily from the courtroom, ignoring the victim's sobbing granddaughter. 
Hal shook his head and followed him down the hall and out of the courthouse. 
They started down the stairs, then Rawlins paused. 
Reaching out he gave Hal's lapel a tug. Hal felt his mouth go dry as David's face was suddenly lit with a huge smile. 
It reminded the attorney of something from a horror film. 
Before Hal could react Rawlins was gone, lost in the courthouse traffic.
Shaken by that horrible smile after months of no emotion at all, Hal looked down at himself. 
His briefcase slid slowly from his trembling, numbed fingers and down the steps. 
There in his lapel, glistening in the late afternoon sunlight, was a hairpin shaped like a butterfly.
 
